[["TIME TABLE OF FOUNDATION ELECTIVES (HUMANITIES)", "Published By: DR TANUSHREE CHOUDHARY, HOD, HUMANITIES AND SOCIAL SCIENCES"], ["Time Table for Pre-Ph.D Course Work. Deptt of Physics", "Published By: Prof. O. P. THAKUR, PROFESSOR, PHYSICS"], ["Revision of Sanitation/Solid Waste Management Charges for the residential\r\naccommodation in NSUT Campus.", "Published By:  SHYAM SINGH, CENTRAL COMPUTER CENTER"], ["Revision of Flat rate of licence fee for the residential accommodation in NSUT Campus", "Published By:  SHYAM SINGH, CENTRAL COMPUTER CENTER"], ["CIRCULAR", "Published By:  SHYAM SINGH, CENTRAL COMPUTER CENTER"], ["Registration Officer for 4th 6th and 8th Semester of (B.E, B.Tech, M.Tech, BBA, MBA and MBA-IEV) Programme", "Published By: Mrs MAHESHWARI CHANDRA, SECTION OFFICER, ACADEMIC SECTION"], ["B.Tech 1st Semester WEST CAMPUS", "Published By: Dr. ATHAR HUSSAIN, ASSOCIATE PROFESSOR, CIVIL ENGINEERING"], ["Provide the attendance for M.Tech students for the Academic Year 2020 21", "Published By: Mrs MAHESHWARI CHANDRA, SECTION OFFICER, ACADEMIC SECTION"], ["Re-registered for the B.Tech 1st Semester Academic Session 2020-21", "Published By: Mrs MAHESHWARI CHANDRA, SECTION OFFICER, ACADEMIC SECTION"], ["GOOGLE CLASSROOM CODES OF WEST CAMPUS COURSES(UPDATED)", "Published By: Dr. ATHAR HUSSAIN, ASSOCIATE PROFESSOR, CIVIL ENGINEERING"], ["M.Tech(IS) 1st Sem Time Table with google classroom code after elective subjects selection by the students for NSUT (East Campus)", "Published By: Dr. AMITA JAIN, COMPUTER SCIENCE AND ENGINEERING"], ["Revised Datesheet of Practical Exams (DU), BSE Deptt", "Published By: Dr. SHILPA SHARMA, PRACTICAL INSTRUCTOR, BIO TECHNOLOGY"], ["ME/MPAE: 4th Sem (NSUT), 6th Sem (DU), 8th Sem (DU) and 2nd (DU-Backlog), 4th(DU-Backlog) Time Table -Even-2021", "Published By: Dr. ANDRIYA NARASIMHULU, ASSISTANT PROFESSOR, MECHANICAL ENGINEERING"], ["Revised Date Sheet of Practical Examinations of NSIT Students of IT Department for Odd Semester-2020", "Published By: Dr DEVENDER KUMAR YADAV, ASSISTANT PROFESSOR, INFORMATION TECHNOLOGY"], ["Notice for Ph. Students", "Published By: Mr LAMBODAR MISHRA, DATA PROCESSOR, ACADEMIC SECTION"], ["ICE/EE Dept: 4th, 6th and 8th Sem Time Table (Main Campus)", "Published By: Ms. JYOTI YADAV, ASSISTANT PROFESSOR, INSTRUMENTATION AND CONTROL ENGINEERING"], ["IT Dept: 4th, 6th and 8th Sem Time Table (Main Campus)", "Published By: Dr. DEEPAK KUMAR SHARMA, INFORMATION TECHNOLOGY"], ["Time Table of IV, VI and VIII Semester, B.Tech/B.E. Biotechnology (Dept. of BSE)", "Published By: Dr YATENDER KUMAR, ASSISTANT PROFESSOR, BIO TECHNOLOGY"], ["CSE Dept: 4th, 6th and 8th Sem Time Table (Main Campus)", "Published By: Dr PREETI KAUR, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["ECE Dept: 4th, 6th and 8th Sem Time Table (Main Campus)", "Published By: Dr. TARUN KUMAR RAWAT, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["MTECH DC  EAST CAMPUS NSUT Class codes", "Published By:  MANISHA KHULBE, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["DATE SHEET FOR M.TECH Dissertation Phase-I,  ICE ODD SEM for NSUT 3rd sem students for Sub Code: ICPCC05, ICIEC05 and ICMKC05", "Published By: Prof SHYAMA KANT JHA, PRACTICAL SUPERINTENDENT, INSTRUMENTATION AND CONTROL ENGINEERING"], ["Time Table of Ist Semester - M.Tech Bioinformatics (BI) and Biochemical Engineering (BCE) (Dept. of BSE)", "Published By: Dr YATENDER KUMAR, ASSISTANT PROFESSOR, BIO TECHNOLOGY"], ["Foundation Elective  I Semester NSUT TIME TABLE 2020 w.e.f 21.12.2020", "Published By: Dr PREETI KAUR, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["Class Codes of FCEC003: Electrical and Electronics Engineering, B Tech . (ICE/EE/BT/MPAE/ME/EIOT/CSDS/ITNS) 1st Sem Course, NSUT (Main Campus)", "Published By: Ms. JYOTI YADAV, ASSISTANT PROFESSOR, INSTRUMENTATION AND CONTROL ENGINEERING"], ["Time Table M. Tech I Semester Industrial Electronics / Electrical Engineering  with Google class codes", "Published By: Ms. JYOTI YADAV, ASSISTANT PROFESSOR, INSTRUMENTATION AND CONTROL ENGINEERING"], ["GOOGLE CLASS CODE FOR M. Tech I Semester Biochemical Engineering/Bioinformatics ITBIC02: Programming Languages in Bioinformatics", "Published By: Dr. DEEPAK KUMAR SHARMA, ASSISTANT PROFESSOR, INFORMATION TECHNOLOGY"], ["I Sem M. Tech (IT, NSUT) Google Class room CODE/LINK (Mobile Computing and Security, Machine Intelligence and Data Analytics)", "Published By: Dr. DEEPAK KUMAR SHARMA, ASSISTANT PROFESSOR, INFORMATION TECHNOLOGY"], ["IT I Sem B. Tech Class code for Computer Programming FCCS002", "Published By: Dr. DEEPIKA KUKREJA, ASSISTANT PROFESSOR, INFORMATION TECHNOLOGY"], ["REVISED DATE SHEET FOR PRACTICAL EXAMINATION OF BE ICE ODD SEM (FOT DU) AND OLD SCHEME FOT DU", "Published By: Prof SHYAMA KANT JHA, PRACTICAL SUPERINTENDENT, INSTRUMENTATION AND CONTROL ENGINEERING"], ["CORRIGENDUM for class code of CSDS branch (FCMT001)", "Published By: DR MAMTA MISHRA, ASSOCIATE PROFESSOR, MATHEMATICS"], ["Class Codes of FCEC003: Electrical and Electronics Engineering, B Tech (ECE/COE/CSAI/IT/MAC) 1st Sem Course, NSUT (Main Campus)", "Published By: Dr. TARUN KUMAR RAWAT, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["REVISED DATE SHEET FOR PRACTICAL EXAMINATION OF BE MPAE AND ME ODD SEM (FOT DU) AND OLD SCHEME FOT DU", "Published By: Dr. A. V. MULEY, ASSOCIATE PROFESSOR, MANUFACTURING PROCESSES AND AUTOMATION ENGINEERING"], ["REVISED PRACTICAL EXAM DATE SHEET FOR ECC17 ECD07, ECD13, ECC22,ECC23 ECE DEPARTEMENT", "Published By: Dr SHWETA GAUTAM, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["FCMT001 Google Class Code 1st  semester B.Tech", "Published By: DR MAMTA MISHRA, ASSOCIATE PROFESSOR, MATHEMATICS"], ["NSUT Roll Number for Students Admitted in Spot Round 3", "Published By:  KHUSHIL KUMAR SAINI, COORDINATOR, UNIVERSITY MANAGEMENT CENTRE, CENTRAL COMPUTER CENTER"], ["BTP END SEM Announcement (Computer Science & Engineering)-on 1 & 2nd JAN 2021", "Published By: Dr. ANAND GUPTA, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["1st Sem B.Tech ECAM   NSUT EAST CAMPUS Google classroom codes", "Published By:  MANISHA KHULBE, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["M.Tech (Digital Communication) Time table 1st Sem NSUT East Campus", "Published By:  MANISHA KHULBE, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["B.Tech (CSDA) 1st Sem NSUT (East Campus)  Google Classroom Code", "Published By: Dr. AMITA JAIN, COMPUTER SCIENCE AND ENGINEERING"], ["Class Code for M Tech (SP, ESV, CN) 1st Sem courses of ECE Dept NSUT(Main Campus)", "Published By: Dr. TARUN KUMAR RAWAT, ASSISTANT PROFESSOR, ELECTRONICS AND COMMUNICATION ENGINEERING"], ["M.Tech(IS)  1st Sem Time Table with google classroom code for NSUT (East Campus)", "Published By: Dr. AMITA JAIN, COMPUTER SCIENCE AND ENGINEERING"], ["Fit India Movement to promote fitness across the country", "Published By:  SHYAM SINGH, COORDINATOR, CENTRAL COMPUTER CENTER"], ["Class Codes: Humanities and Social Sciences - English, Technical Communication, Social Work (EO010), Basics of Social Sciences (EO008)", "Published By: DR TANUSHREE CHOUDHARY, HOD, HUMANITIES AND SOCIAL SCIENCES"], ["Google class codes for the subject FCCS002 computer Programming/First Semester. Classes to commence from 21/12/2020", "Published By:  RITU SIBAL, PROFESSOR, COMPUTER ENGINEERING"], ["IV/VI/VIII  SEMESTER  B.TECH/M.TECH/BBA/MBA/MBA-IEV REGISTRATION  SCHEDULE.", "Published By: Dr. SUJATA SENGAR, DEAN ACADEMICS, ACADEMIC SECTION"], ["FCCS002 Google Class room code I semester B tech.", "Published By: Dr PREETI KAUR, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"], ["Google class code - I semester M Tech. Time Table (Computer Science)", "Published By: Dr PREETI KAUR, ASSOCIATE PROFESSOR, COMPUTER ENGINEERING"]]